{
    "7.1": {
        "title": "Art. 7.1",
        "subtitle": "Demonstration",
        "green": "Awesome! Your document should be compliant with Art.7.1 requirements.",
        "yellow": "Please input the referenced document. Compliance cannot be determined because the document makes reference to external policies or documents for details on consent, without directly stating consent is the basis for processing.",
        "red": "Not compliant. Consent cannot be not demonstrated properly as a basis for processing. You (Data Controller) have the burden of proving the existence of valid conseent. This is contrary to the principle of accountability."
    },
    "7.2": {
        "title": "Art. 7.2",
        "subtitle": "Distinguishability and transparency ",
        "green": "Awesome! Your document should be compliant with Art.7.2 requirements.",
        "yellow": "Consent needs to be clearly distinguishable from other matters, in an intelligible, easily accessible form, using plain language, particularly for each consent for specific purposes of processing.",
        "red": "Not compliant. Consent sought is not clearly distinguishable from other matters, in an intelligible, easily accessbile form, using plain language, nor well-informed. This is contrary to the principle of transparency."
    },
    "7.3": {
        "title": "Art. 7.3",
        "subtitle": "Withdrawal of consent",
        "green": "Awesome! Your document should be compliant with Art.7.3 requirements.",
        "yellow": "",
        "red": "Not compliant. There is no proper right to withdraw the consent, there is not information on such right nor can consent be withdrawn as easily as giving it. This is contrary to the statutory right of withdrawal of consent."
    },
    "7.4": {
        "title": "Art. 7.4",
        "subtitle": "“Freely given” and conditional consent",
        "green": "Awesome! Your document should be compliant with  Art.7.4 requirements.",
        "yellow": "The controller is a public authority, which is considered as a clear power imbalance between the parties. Therefore, it is unlikely that consent was freely given.",
        "red": "Not compliant. The consent is conditional on performance. This is contrary to requirement that consent must be freely given."
    }
}